demoManageCreateOrderSuccessRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:man="http://www.wstutorial.com/ws/ManageOrderService">
   <soapenv:Header/>
   <soapenv:Body>
      <man:ManageCreateOrder>
         <order>
            <id>?</id>
            <!--1 or more repetitions:-->
            <products>
               <!--1 or more repetitions:-->
               <product>
                  <productHeader>
                     <!--You may enter the following 3 items in any order-->
                     <id>1</id>
                     <label>?</label>
                     <price>?</price>
                  </productHeader>
                  <quantity>10</quantity>
               </product>
               <product>
                  <productHeader>
                     <!--You may enter the following 3 items in any order-->
                     <id>2</id>
                     <label>?</label>
                     <price>?</price>
                  </productHeader>
                  <quantity>20</quantity>
               </product>
            </products>
            <sellerId>101</sellerId>
            <customerId>201</customerId>
            <status>?</status>
         </order>
      </man:ManageCreateOrder>
   </soapenv:Body>
</soapenv:Envelope>